;(function (win) {

    win.cityObject = ['北京', '上海', '广州', '深圳', '天津', '南京', '杭州', '武汉', '成都']

    win.codeObject = {
        '北京': 'bj',
        '上海': 'sh',
        '广州': 'gz',
        '深圳': 'sz',
        '天津': 'tj',
        '南京': 'nj',
        '杭州': 'hz',
        '武汉': 'wh',
        '成都': 'cd'
    }

    win.dircObject = {
        '北京': [
            '东城区', '西城区', '朝阳区', '海淀区', '丰台区', '石景山区', '通州区', '昌平区', '大兴区', '顺义区', '房山区'
        ],
        '深圳': [
            '南山区', '福田区', '罗湖区', '宝安区', '龙岗区', '龙华区'
        ],
        '上海': [
            '徐汇区', '闵行区', '松江区', '闸北区', '宝山区', '浦东新区', '长宁区', '虹口区', '普陀区', '嘉定区'
        ],
        '杭州': [
            '滨江区', '西湖区', '拱墅区', '江干区', '下城区', '余杭区', '上城区', '萧山区'
        ],
        '天津': [
            '东丽区', '和平区', '河北区', '河东区', '河西区', '红桥区', '南开区', '西青区'
        ],
        '武汉': [
            '武昌区', '硚口区', '江岸区', '江汉区', '洪山区', '汉阳区', '江夏区'
        ],
        '南京': [
            '江宁区', '白下区', '浦口区', '栖霞区', '秦淮区', '下关区', '玄武区', '雨花台区'
        ],
        '广州': [
            '海珠区', '天河区'
        ],
        '成都': [
            '武侯区', '高新区'
        ]
    }
    win.blockObject = {
        '北京': {
            '朝阳门': '朝阳区',
            '四惠': '朝阳区',
            '西二旗': '海淀区',
            '青年路': '朝阳区',
            '上地': '海淀区',
            '望京': '朝阳区',
            '天通苑': '昌平区',
            '常营': '朝阳区',
            '大望路': '朝阳区',
            '欢乐谷景区': '朝阳区',
            '物资学院路': '通州区',
            '管庄': '朝阳区',
            '六里桥': '丰台区',
            '十里堡': '朝阳区',
            '立水桥': '朝阳区',
            '三元桥': '朝阳区',
            '宋家庄': '丰台区',
            '将台': '朝阳区',
            '双井': '朝阳区',
            '黄渠': '朝阳区',
            '新宫': '丰台区',
        },
        '广州': {
            '车陂': '天河区',
            '华师': '天河区',
            '东晓南': '海珠区',
            '潭村': '天河区',
            '中大': '海珠区',
            '客村': '海珠区',
            '燕塘': '天河区',
            '赤岗': '海珠区',
            '林和西': '天河区',
            '昌岗': '海珠区',
            '岗顶': '天河区',
            '江南西': '海珠区',
            '鹭江': '海珠区',
            '员村': '天河区',
            '石牌桥': '天河区',
            '市二宫': '海珠区',
            '沙园': '海珠区',
            '科韵路': '天河区',
            '广州东站': '天河区',
            '琶洲': '海珠区',
            '磨碟沙': '海珠区',
            '三溪': '天河区',
        },
        '杭州': {
            '滨江区政府': '滨江区',
            '火车东站': '江干区',
            '金沙湖': '江干区',
            '西兴': '滨江区',
            '三墩': '西湖区',
            '九堡': '江干区',
            '申花': '拱墅区',
            '长河': '滨江区',
            '浦沿': '滨江区',
            '奥体': '滨江区',
            '景芳': '江干区',
            '沿江北': '江干区',
            '拱宸桥': '拱墅区',
            '文一西路': '西湖区',
            '翠苑': '西湖区',
            '钱江新城': '江干区',
            '古荡': '西湖区',
            '和睦': '拱墅区',
            '万达广场': '拱墅区',
            '沿江南': '江干区',
            '未来科技城': '余杭区',
            '彩虹城': '滨江区',
        },
        '南京': {
            '迈皋桥': '栖霞区',
            '南京南站': '江宁区',
            '小行': '雨花台区',
            '双龙大道': '江宁区',
            '竹山路': '江宁区',
            '安德门': '雨花台区',
            '五塘广场': '下关区',
            '翠屏山': '江宁区',
            '卡子门': '雨花台区',
            '胜太西路': '江宁区',
            '胜太路': '江宁区',
            '南京林业大学·新庄': '玄武区',
            '中华门': '雨花台区',
            '龙眠大道': '江宁区',
            '春江路': '雨花台区',
            '河定桥': '江宁区',
            '雨花门': '秦淮区',
            '百家湖': '江宁区',
            '经天路': '栖霞区',
            '秣周东路': '江宁区',
            '天印大道': '江宁区',
            '天元西路': '江宁区',
        },
        '上海': {
            '七宝': '闵行区',
            '徐家汇': '徐汇区',
            '莘庄': '闵行区',
            '虹桥路': '徐汇区',
            '九亭': '松江区',
            '上海西站': '普陀区',
            '世纪公园': '浦东新区',
            '真如': '普陀区',
            '合川路': '闵行区',
            '宋园路': '长宁区',
            '龙柏新村': '闵行区',
            '莲花路': '闵行区',
            '御桥': '浦东新区',
            '漕宝路': '徐汇区',
            '广兰路': '浦东新区',
            '龙阳路': '浦东新区',
            '宜山路': '徐汇区',
            '顾戴路': '闵行区',
            '川沙': '浦东新区',
            '三林': '浦东新区',
            '东陆路': '浦东新区',
            '金桥路': '浦东新区',
        },
        '深圳': {
            '南山': '南山区',
            '观澜老墟': '龙华区',
            '岗厦': '福田区',
            '福田': '福田区',
            '大新': '南山区',
            '桃园': '南山区',
            '西乡': '宝安区',
            '后海': '南山区',
            '上梅林': '福田区',
            '深大': '南山区',
            '景田': '福田区',
            '石厦': '福田区',
            '清湖': '龙华区',
            '灵芝': '宝安区',
            '登良': '南山区',
            '沙尾': '福田区',
            '白石洲': '南山区',
            '五和': '龙岗区',
            '益田': '福田区',
            '莲花村': '福田区',
            '车公庙': '福田区',
            '民治': '龙华区',
        },
        '天津': {
            '海光寺': '南开区',
            '下瓦房': '河西区',
            '西康路': '和平区',
            '鞍山西道': '南开区',
            '土城': '河西区',
            '小白楼': '和平区',
            '天津站': '河东区',
            '南楼': '河西区',
            '王顶堤': '南开区',
            '吴家窑': '河西区',
            '天拖': '南开区',
            '东南角': '南开区',
            '西南角': '南开区',
            '营口道': '和平区',
            '陈塘庄': '河西区',
            '大王庄': '河东区',
            '天塔': '南开区',
            '二纬路': '南开区',
            '鞍山道': '和平区',
            '广开四马路': '南开区',
            '宜宾道': '南开区',
            '一中心医院': '南开区',
        },
        '武汉': {
            '光谷广场': '洪山区',
            '光谷软件园': '洪山区',
            '虎泉': '洪山区',
            '关山大道': '洪山区',
            '丁字桥路': '洪山区',
            '街道口': '洪山区',
            '徐东': '洪山区',
            '大智路': '江岸区',
            '范湖': '江汉区',
            '杨家湾': '洪山区',
            '积玉桥': '武昌区',
            '光谷一路': '江夏区',
            '武昌火车站': '武昌区',
            '中南路': '武昌区',
            '东亭': '武昌区',
            '唐家墩': '江汉区',
            '大舒东路': '江夏区',
            '高新四路': '江夏区',
            '宝通寺': '武昌区',
            '小龟山': '武昌区',
            '岳家嘴': '洪山区',
            '楚河汉街': '武昌区',
        }
        ,
        '成都': {
            '倪家桥': '武侯区',
            '高新': '高新区',
            '世纪城': '高新区'
        }
    }
    win.plotObject = {
        '上海': [
            '万科城市花园(上海)',
            '名都新城',
            '银霄大厦',
            '奥林匹克花园',
            '知雅汇（公寓）',
            '万兆家园',
            '苗桐佳苑',
            '实业公寓',
            '和家欣苑',
            '浦发绿城',
            '九城湖滨国际',
            '申城佳苑三期B块',
            '花木苑（楼梯）',
            '新高苑（一至三期）',
            '阳明国际花苑',
            '万里一期（凯旋花园）',
        ],
        '北京': [
            '新建村小区',
            '德鑫嘉园三期',
            '垡头翠城馨园',
            '常营民族家园',
            '首开华润城',
            '管庄新村',
            '马连店小区',
            '龙冠冠华苑二区',
            '世界侨商中心',
            '回龙观新村中区',
            '紫金新干线四期',
            '连心园西区',
            '金隅汇星苑',
            '枫泉花园',
            '友谊嘉园三期',
            '北花园小区',
        ],
        '广州': [
            '天河广场',
            '金燕花苑',
            '美林湖畔花园',
            '东尚名苑',
            '美好居',
            '金碧花园第二金碧',
            '金碧花园第三金碧',
            '锦丽居一期',
            '美景花苑',
            '骏景花园',
            '美林海岸花园',
            '太阳广场',
            '翠城花园',
            '信和广场',
            '时尚明苑',
            '东景花园',
        ],
        '杭州': [
            '绿地旭辉城',
            '缤纷东苑',
            '尚堂府',
            '伊萨卡国际城浩泽园',
            '招商雍景湾',
            '钱江府',
            '东海柠檬郡',
            '秀里华庭',
            '融信学院府',
            '天城府',
            '景瑞申花壹号院',
            '蓝桥名苑',
            '龙湖春江彼岸',
            '野风海天城',
            '融信蓝孔雀',
            '迎春南苑',
        ],
        '南京': [
            '龙西新寓',
            '中垠紫金观邸',
            '金轮津桥华府',
            '中电颐和府邸',
            '翠屏诚园',
            '金浦御龙湾',
            '太平花苑北区',
            '秦湾景园',
            '保利中央公园',
            '中南锦苑',
            '太平花苑南区',
            '南京万达茂御湖仕家',
            '保利梧桐语花园',
            '胜利新寓',
            '新城香悦澜山',
            '万裕龙庭水岸',
        ],
        '天津': [
            '中海复兴九里',
            '中海寰宇天下',
            '景兴西里',
            '三潭东里',
            '蘭园',
            '城市之光月光园',
            '中冶德贤公馆',
            '新城小区',
            '龙都花园',
            '东亚风尚国际',
            '万春花园',
            '艺术公寓',
            '馨名园',
            '振河里',
            '时代奥城',
            '元兴新里',
        ],
        '深圳': [
            '港铁天颂',
            '益田村',
            '前海丹华园',
            '桃源居',
            '佳华领汇广场',
            '锦荟PARK',
            '信义嘉御山5期',
            '万科天誉',
            '彩福大厦',
            '阳光棕榈园',
            '金地龙城中央',
            '前海花园',
            '星河传奇',
            '鸿荣源尚峰',
            '世纪春城',
            '中海锦城',
        ],
        '武汉': [
            '金地格林东郡',
            '保利时代',
            '金地天悦',
            '金地自在城',
            '联想江城雅居',
            '融科天域',
            '清江山水',
            '金沙泊岸',
            '统建天成美景',
            '群建星城',
            '平安光谷春天',
            '武铁佳苑',
            '保利花园',
            '现代森林小镇',
            '万科嘉园光谷的光',
            '长投珑庭',
        ],
        '成都': [
            '世龙广场',
            '国嘉美领居'
        ]
    }

    win.getBlockList = function (city, code, b) {

        var blocklist = ''

        for (block in blockObject[city]) {

            var className = (block === b) ? 'issel' : ''
            var url = (block === b) ? 'javascript:;' : '/room/' + code + '/d' + blockObject[city][block] + '-b' + block + '.html'

            blocklist += '<a target="_blank" class="' + className + '" href="' + url + '">' + block + '租房</a>'
        }

        $('.crumbs-list.block').empty()
        $('.crumbs-list.block').append(blocklist)
    }
    win.getPlotList = function (city, code, plot) {

        var plotlist = ''

        $(plotObject[city]).each(function (index, value) {

            var className = (value === plot) ? 'issel' : ''
            var url = (value === plot) ? 'javascript:;' : '/room/' + code + '?search_text=' + value

            plotlist += '<a target="_blank" class="' + className + '" href="' + url + '">' + value + '租房</a>'
        })

        $('.crumbs-list.plot').empty()
        $('.crumbs-list.plot').append(plotlist)
    }
    win.getDircList = function (city, code, dirc) {

        var dirclist = ''

        $(dircObject[city]).each(function (index, value) {

            var className = (value === dirc) ? 'issel' : ''
            var url = (value === dirc) ? 'javascript:;' : '/room/' + code + '/d' + value + '.html'

            dirclist += '<a target="_blank" class="' + className + '" href="' + url + '">' + value + '租房</a>'
        })

        $('.crumbs-list.dirc').empty()
        $('.crumbs-list.dirc').append(dirclist)
    }

    win.getCityList = function (city, code) {

        var citylist = ''

        $(cityObject).each(function (index, value) {

            var className = (value === city) ? 'issel' : ''
            var url = (value === city) ? 'javascript:;' : '/room/' + codeObject[value]

            citylist += '<a target="_blank" class="' + className + '" href="' + url + '">' + value + '租房</a>'
        })

        $('.crumbs-list.city').empty()
        $('.crumbs-list.city').append(citylist)
    }


})(window)